import torch
import math

#input = torch.tensor([0.90704336654554, -0.170284556549587, -0.385065580137258]).unsqueeze(0)
#target = torch.tensor([0.859034026592892, -0.0245438293312255, -0.511329777733864]).unsqueeze(0)

#input = torch.tensor([0.90704336654554, -0.170284556549587, -0.385065580137258]).unsqueeze(0)
#target = torch.tensor([0.859034026592892, -0.0245438293312255, -0.511329777733864]).unsqueeze(0)

# With glasses
normalized_heads_with_glasses = [
    [0.892691055276964, 0.363083024076627, -0.266970780153692],
    [0.952973786353965, 0.0985190277575126, -0.286591981206562],
    [0.92629938822893, -0.249465692641024, -0.282376188022013],
    [0.926967926293379, -0.252785398348829, -0.277182261346171],
    [0.925730175321243, -0.261894915993718, -0.272827226420574],
    [0.930087140819712, -0.251879280913225, -0.267385000193447],
    [0.828191519683308, 0.451719362999281, -0.3317354726528],
    [0.952076753617989, 0.0926342076011451, -0.291494011606311],
    [0.930065462051721, -0.24112502064693, -0.277194806438606]
]
# Without glasses
normalized_heads_without_glasses = [
    [0.888542030733148, 0.368154182983112, -0.273780125598355],
    [0.94795600564918, 0.117872003128543, -0.295779651484203],
    [0.92980136994169, -0.234337347291652, -0.28382286750519],
    [0.926078395427552, -0.257763616559801, -0.275566187149914],
    [0.926547986799825, -0.255813116758867, -0.275805143989928],
    [0.929757295369831, -0.251554712124355, -0.268833774876986],
    [0.890180534141439, 0.365526726619219, -0.271972110266294],
    [0.951492107995998, 0.0930677739455012, -0.293259540124719],
    [0.931170008021522, -0.234533513823314, -0.27913517702878]
]

normalized_gaze_with_glasses = [
    [0.899108395362679, -0.400529285176023, -0.176579684858518],
    [0.970147962933953, -0.176429629542274, -0.166389650623698],
    [0.985326784920896, -0.0332948913601953, -0.167399453782751],
    [0.908068496739251, -0.177519706125246, -0.379339372023156],
    [0.812024994165549, 0.250778454043368, -0.526996751259491],
    [0.745340034993715, 0.517680024305078, -0.420090019723227],
    [0.779540357926037, -0.486990223601612, -0.393900180859309],
    [0.853477548431937, -0.236079321874926, -0.464588665494204],
    [0.765141537132635, 0.467310938805254, -0.442920889806815]
]

normalized_gaze_without_glasses = [
    [0.856145710335472, -0.371278139734105, -0.359398199257804],
    [0.876561043940997, -0.210060250171404, -0.433030515718],
    [0.795029932501962, 0.268149977234068, -0.544079953807614],
    [0.87863375752923, 0.219640939307467, -0.4239818131833],
    [0.79752042152953, 0.26558014037242, -0.541690286310476],
    [0.69796696458317, 0.453928025894004, -0.553887591175798],
    [0.18164875973375, -0.588355982807317, -0.787934620118971],
    [0.829338689770306, -0.277789561134508, -0.484799234090535],
    [0.776481660274861, 0.354360757694982, -0.521061114134065]
]

def yaw_pitch_to_vector(x):
    x = torch.reshape(x, (-1, 2))
    output = torch.zeros((x.size(0), 3))
    output[:,2] = - torch.cos(x[:,1]) * torch.cos(x[:,0])
    output[:,0] = torch.cos(x[:,1]) * torch.sin(x[:,0])
    output[:,1] = torch.sin(x[:,1])
    return output

def compute_angular_error(input, target):
    if input.shape[-1] == 2:
        input = yaw_pitch_to_vector(input)
    if target.shape[-1] == 2:
        target = yaw_pitch_to_vector(target)

    # input = smooth_filter(input)
    target =  target / torch.norm(target,dim=1).unsqueeze(1)
    input = input.view(-1, 3, 1)
    target = target.view(-1, 1, 3)
    output_dot = torch.bmm(target, input)  # 带batch的矩阵乘法，结果是（-1，1，1），也就是两个三维向量做内积
    output_dot = output_dot.view(-1)  # 变成一维tensor
    output_dot = torch.acos(output_dot)
    output_dot = output_dot.data
    output_dot = 180 * torch.mean(output_dot) / math.pi  # 转换成角度
    # 计算两个三维向量的夹角 有 cos theta = 两向量点积除以两向量的模
    return output_dot

for i in range(len(normalized_gaze_with_glasses)):
    input_glasses = torch.tensor(normalized_heads_with_glasses[i]).unsqueeze(0)
    target_glasses = torch.tensor(normalized_gaze_with_glasses[i]).unsqueeze(0)
    input_normal = torch.tensor(normalized_heads_without_glasses[i]).unsqueeze(0)
    target_normal = torch.tensor(normalized_gaze_without_glasses[i]).unsqueeze(0)
    print(compute_angular_error(input_glasses, target_glasses).item())
    print(compute_angular_error(input_normal, target_normal).item())

